Public Attributes | List of all members
API_Element Union Reference
Element Manager API
A union collecting all known element types. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | header
General element header.
API_WallType  | wall
Represents a wall.
API_ColumnType  | column
Represents a column.
API_BeamType  | beam
Represents a beam.
API_WindowType  | window
Represents a window.
API_DoorType  | door
Represents a door.
API_ObjectType  | object
Represents an object.
API_LampType  | lamp
Represents a lamp.
API_SlabType  | slab
Represents a slab.
API_RoofType  | roof
Represents a roof.
API_MeshType  | mesh
Represents a mesh.
API_DimensionType  | dimension
Represents a dimension.
API_RadialDimensionType  | radialDimension
Represents a radial dimension.
API_LevelDimensionType  | levelDimension
Represents a level dimension.
API_AngleDimensionType  | angleDimension
Represents an angle dimension.
API_TextType  | text
Represents a text.
API_LabelType  | label
Represents a label.
API_ZoneType  | zone
Represents a zone.
API_HatchType  | hatch
Represents a hatch.
API_LineType  | line
Represents a 2D line.
API_PolyLineType  | polyLine
Represents a 2D polyline.
API_ArcType  | arc
Represents a 2D arc.
API_CircleType  | circle
Represents a 2D circle.
API_SplineType  | spline
Represents a 2D spline.
API_HotspotType  | hotspot
Represents a hotspot.
API_PictureType  | picture
Represents a picture.
API_CutPlaneType  | cutPlane
Represents a section.
API_ElevationType  | elevation
Represents an elevation.
API_InteriorElevationType  | interiorElevation
Represents an interior elevation.
API_CameraType  | camera
Represents a camera.
API_CamSetType  | camset
Represents a camera set.
API_DrawingType  | drawing
Represents a drawing element.
API_SectElemType  | sectElem
Represents an element in the section window.
API_DetailType  | detail
Represents a detail drawing.
API_WorksheetType  | worksheet
Represents a worksheet.
API_HotlinkType  | hotlink
Represents a hotlink.
API_CurtainWallType  | curtainWall
Represents a curtain wall.
API_CWSegmentType  | cwSegment
Represents a curtain wall segment.
API_CWFrameType  | cwFrame
Represents a curtain wall frame.
API_CWPanelType  | cwPanel
Represents a curtain wall panel.
API_CWJunctionType  | cwJunction
Represents a curtain wall junction.
API_CWAccessoryType  | cwAccessory
Represents a curtain wall accessory.
API_ShellType  | shell
Represents a shell (kind of a roof with special geometry).
API_MorphType  | morph
Represents a morph.
API_SkylightType  | skylight
Represents a skylight (a window put into roofs and shells).
API_ChangeMarkerType  | changeMarker
Represents a ChangeMarker.
API_StairType  | stair
Represents a Stair.
API_StairRiserType  | stairRiser
Represents a Riser.
API_StairTreadType  | stairTread
Represents a Tread.
API_StairStructureType  | stairStructure
Represents a Stair structure.
API_RailingType  | railing
Represents a Railing structure.
API_RailingToprailType  | railingToprail
Represents a Toprail structure.
API_RailingHandrailType  | railingHandrail
Represents a Handrail structure.
API_RailingRailType  | railingRail
Represents a Rail structure.
API_RailingRailEndType  | railingToprailEnd
Represents a Toprail End structure.
API_RailingRailEndType  | railingHandrailEnd
Represents a Handrail End structure.
API_RailingRailEndType  | railingRailEnd
Represents a Rail End structure.
API_RailingFinishType  | railingEndFinish
API_RailingRailConnectionType  | railingToprailConnection
Represents a Toprail Connection structure.
API_RailingRailConnectionType  | railingHandrailConnection
Represents a Handrail Connection structure.
API_RailingRailConnectionType  | railingRailConnection
Represents a Rail Connection structure.
API_RailingPostType  | railingPost
Represents a Railing Post structure.
API_RailingInnerPostType  | railingInnerPost
Represents an Inner Post structure.
API_RailingBalusterSetType  | railingBalusterSet
Represents a Baluster Set structure.
API_RailingBalusterType  | railingBaluster
Represents a Baluster structure.
API_RailingPanelType  | railingPanel
Represents a Railing Panel structure.
API_RailingNodeType  | railingNode
Represents a Railing Node structure.
API_RailingSegmentType  | railingSegment
Represents a Railing Segment structure.
API_RailingPatternType  | railingPattern
Represents a Railing Pattern structure.
API_ColumnSegmentType  | columnSegment
Represents a Column segment structure.
API_BeamSegmentType  | beamSegment
Represents a Beam segment structure.
API_OpeningType  | opening
API_ExternalElemType  | externalElem
Represents an external element. See remarks for more information.
Detailed Description
A union collecting all known element types.
Since
Archicad 26
Remarks
Database items named elements are global collections of constuction and drawing elements which are placed onto the floorplan, Section/Elevation etc. windows. API functions operating on the element databases begin with the ACAPI_Element_ prefix, refer to the Element Manager for more details. Many element related functions use the API_Element structure on the parameter list. As a general rule, you have to fill the required fields in the union, then the server application parses the request based on the values and passes the return parameters in the same parameter. This is why most of the functions do not have the const directive in the prototypes. Refer to the Save data into the Element records document to get information how to save/assign custom data to the element records and save it into the project file for later use. In version 26 the Analytical element types were replaced by the externalElem member. The former structures (e.g. API_AnalyticalLinkType) can be obtained by the appropriate functions (e.g. ACAPI_Analytical_GetLinkFromElement).
Member Data Documentation
◆ angleDimension
 API_Element::angleDimension
Represents an angle dimension.
◆ arc
 API_Element::arc
Represents a 2D arc.
◆ beam
 API_Element::beam
Represents a beam.
◆ beamSegment
 API_Element::beamSegment
Represents a Beam segment structure.
◆ camera
 API_Element::camera
Represents a camera.
◆ camset
 API_Element::camset
Represents a camera set.
◆ changeMarker
 API_Element::changeMarker
Represents a ChangeMarker.
◆ circle
 API_Element::circle
Represents a 2D circle.
◆ column
 API_Element::column
Represents a column.
◆ columnSegment
 API_Element::columnSegment
Represents a Column segment structure.
◆ curtainWall
 API_Element::curtainWall
Represents a curtain wall.
◆ cutPlane
 API_Element::cutPlane
Represents a section.
◆ cwAccessory
 API_Element::cwAccessory
Represents a curtain wall accessory.
◆ cwFrame
 API_Element::cwFrame
Represents a curtain wall frame.
◆ cwJunction
 API_Element::cwJunction
Represents a curtain wall junction.
◆ cwPanel
 API_Element::cwPanel
Represents a curtain wall panel.
◆ cwSegment
 API_Element::cwSegment
Represents a curtain wall segment.
◆ detail
 API_Element::detail
Represents a detail drawing.
◆ dimension
 API_Element::dimension
Represents a dimension.
◆ door
 API_Element::door
Represents a door.
◆ drawing
 API_Element::drawing
Represents a drawing element.
◆ elevation
 API_Element::elevation
Represents an elevation.
◆ externalElem
 API_Element::externalElem
Represents an external element. See remarks for more information.
◆ hatch
 API_Element::hatch
Represents a hatch.
◆ header
 API_Element::header
General element header.
◆ hotlink
 API_Element::hotlink
Represents a hotlink.
◆ hotspot
 API_Element::hotspot
Represents a hotspot.
◆ interiorElevation
 API_Element::interiorElevation
Represents an interior elevation.
◆ label
 API_Element::label
Represents a label.
◆ lamp
 API_Element::lamp
Represents a lamp.
◆ levelDimension
 API_Element::levelDimension
Represents a level dimension.
◆ line
 API_Element::line
Represents a 2D line.
◆ mesh
 API_Element::mesh
Represents a mesh.
◆ morph
 API_Element::morph
Represents a morph.
◆ object
 API_Element::object
Represents an object.
◆ opening
 API_OpeningType API_Element::opening
◆ picture
 API_Element::picture
Represents a picture.
◆ polyLine
 API_Element::polyLine
Represents a 2D polyline.
◆ radialDimension
 API_Element::radialDimension
Represents a radial dimension.
◆ railing
 API_Element::railing
Represents a Railing structure.
◆ railingBaluster
 API_Element::railingBaluster
Represents a Baluster structure.
◆ railingBalusterSet
 API_Element::railingBalusterSet
Represents a Baluster Set structure.
◆ railingEndFinish
 API_RailingFinishType API_Element::railingEndFinish
◆ railingHandrail
 API_Element::railingHandrail
Represents a Handrail structure.
◆ railingHandrailConnection
 API_Element::railingHandrailConnection
Represents a Handrail Connection structure.
◆ railingHandrailEnd
 API_Element::railingHandrailEnd
Represents a Handrail End structure.
◆ railingInnerPost
 API_Element::railingInnerPost
Represents an Inner Post structure.
◆ railingNode
 API_Element::railingNode
Represents a Railing Node structure.
◆ railingPanel
 API_Element::railingPanel
Represents a Railing Panel structure.
◆ railingPattern
 API_Element::railingPattern
Represents a Railing Pattern structure.
◆ railingPost
 API_Element::railingPost
Represents a Railing Post structure.
◆ railingRail
 API_Element::railingRail
Represents a Rail structure.
◆ railingRailConnection
 API_Element::railingRailConnection
Represents a Rail Connection structure.
◆ railingRailEnd
 API_Element::railingRailEnd
Represents a Rail End structure.
◆ railingSegment
 API_Element::railingSegment
Represents a Railing Segment structure.
◆ railingToprail
 API_Element::railingToprail
Represents a Toprail structure.
◆ railingToprailConnection
 API_Element::railingToprailConnection
Represents a Toprail Connection structure.
◆ railingToprailEnd
 API_Element::railingToprailEnd
Represents a Toprail End structure.
◆ roof
 API_Element::roof
Represents a roof.
◆ sectElem
 API_Element::sectElem
Represents an element in the section window.
◆ shell
 API_Element::shell
Represents a shell (kind of a roof with special geometry).
◆ skylight
 API_Element::skylight
Represents a skylight (a window put into roofs and shells).
◆ slab
 API_Element::slab
Represents a slab.
◆ spline
 API_Element::spline
Represents a 2D spline.
◆ stair
 API_Element::stair
Represents a Stair.
◆ stairRiser
 API_Element::stairRiser
Represents a Riser.
◆ stairStructure
 API_Element::stairStructure
Represents a Stair structure.
◆ stairTread
 API_Element::stairTread
Represents a Tread.
◆ text
 API_Element::text
Represents a text.
◆ wall
 API_Element::wall
Represents a wall.
◆ window
 API_Element::window
Represents a window.
◆ worksheet
 API_Element::worksheet
Represents a worksheet.
◆ zone
 API_Element::zone
Represents a zone.